davidhuwyler/openmv/src/omv_imxrt/lepton.c
/*
 * This file is part of the OpenMV project.
 * Copyright (c) 2013-2018 Ibrahim Abdelkader <i.abdalkader@gmail.com>
 * This work is licensed under the MIT license, see the file LICENSE for details.
 *
 * Lepton driver.
 *
 */

#include "mp.h"
#include "irq.h"
#include "cambus.h"
#include "sensor.h"
#include "systick.h"
#include "framebuffer.h"
#include "mpconfigboard.h"
#include "omv_boardconfig.h"
#include "common.h"

#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_clock.h"
#include "fsl_lpspi.h"
#include "fsl_edma.h"
#include "fsl_lpspi_edma.h"
#include "fsl_lpspi_cmsis.h"
#include "fsl_dmamux.h"
#include "fsl_iomuxc.h"

#if defined(OMV_ENABLE_LEPTON)
#include "crc16.h"
#include "LEPTON_SDK.h"
#include "LEPTON_AGC.h"
#include "LEPTON_SYS.h"
#include "LEPTON_VID.h"
#include "LEPTON_OEM.h"
#include "LEPTON_RAD.h"
#include "LEPTON_I2C_Reg.h"

#define VOSPI_LINE_PIXELS       (80)
#define VOSPI_NUMBER_PACKETS    (60)
#define VOSPI_SPECIAL_PACKET    (20)
#define VOSPI_LINE_SIZE         (80 * 2)
#define VOSPI_HEADER_SIZE       (4)
#define VOSPI_PACKET_SIZE       (VOSPI_HEADER_SIZE + VOSPI_LINE_SIZE)
#define VOSPI_HEADER_SEG(buf)   (((buf[0] >> 4) & 0x7))
#define VOSPI_HEADER_PID(buf)   (((buf[0] << 8) | (buf[1] << 0)) & 0x0FFF)
#define VOSPI_HEADER_CRC(buf)   (((buf[2] << 8) | (buf[3] << 0)))
#define VOSPI_FIRST_PACKET      (0)
#define VOSPI_FIRST_SEGMENT     (1)
#define LEPTON_TIMEOUT          (1000)
#define DEFAULT_MIN_TEMP        (-17.7778f)
#define DEFAULT_MAX_TEMP        (37.7778f)

static bool radiometry = false;
static int h_res = 0;
static int v_res = 0;
static bool v_flip = false;
static bool h_mirror = false;
static bool measurement_mode = false;
static float min_temp = DEFAULT_MIN_TEMP;
static float max_temp = DEFAULT_MAX_TEMP;

static lpspi_master_config_t mstCfg;
static clock_mux_t clockSel;
static clock_div_t clockDiv;

#define DRIVER_MASTER_SPI Driver_SPI4
#define LEPTON_LPSPI_MASTER_IRQN (LPSPI4_IRQn)
#define LEPTON_LPSPI_DEALY_COUNT 0xfffffU
#define LEPTON_LPSPI_MASTER_DMA_MUX_BASEADDR DMAMUX
#define LEPTON_LPSPI_MASTER_DMA_BASEADDR DMA0

#define LPSPI_CLOCK_SOURCE_SELECT  (1U)
#define LPSPI_CLOCK_SOURCE_DIVIDER (7U)
#define LPSPI_CLOCK_FREQ (CLOCK_GetFreq(kCLOCK_Usb1PllPfd0Clk) / (LPSPI_CLOCK_SOURCE_DIVIDER + 1U))
#define LPSPI_MASTER_CLOCK_FREQ LPSPI_CLOCK_FREQ
#define LPSPI_SLAVE_CLOCK_FREQ LPSPI_CLOCK_FREQ

uint32_t LPSPI4_GetFreq(void)
{
    return LPSPI_CLOCK_FREQ;
}


LEP_CAMERA_PORT_DESC_T   LEPHandle;
extern uint8_t _line_buf;
extern uint8_t _vospi_buf;

static bool vospi_resync = true;
static uint8_t *vospi_packet = &_line_buf;
static uint8_t *vospi_buffer = &_vospi_buf;
static volatile uint32_t vospi_pid = 0;
static volatile uint32_t vospi_seg = 1;
static uint32_t vospi_packets = 60;
static int lepton_reset(sensor_t *sensor, bool measurement_mode);

void LEPTON_SPI_IRQHandler(void)
{
    //HAL_SPI_IRQHandler(&SPIHandle);
}

void LEPTON_SPI_DMA_IRQHandler(void)
{
    //HAL_DMA_IRQHandler(SPIHandle.hdmarx);
}

static void lepton_sync()
{
    //HAL_SPI_Abort(&SPIHandle);

    // Disable DMA IRQ
    //HAL_NVIC_DisableIRQ(LEPTON_SPI_DMA_IRQn);

    debug_printf("resync...\n");
    systick_sleep(200);

    vospi_resync = false;
    vospi_pid = VOSPI_FIRST_PACKET;
    vospi_seg = VOSPI_FIRST_SEGMENT;

    //HAL_NVIC_EnableIRQ(LEPTON_SPI_DMA_IRQn);
    //HAL_SPI_Receive_DMA(&SPIHandle, vospi_packet, VOSPI_PACKET_SIZE);
}

static uint16_t lepton_calc_crc(uint8_t *buf)
{
    buf[0] &= 0x0F;
    buf[1] &= 0xFF;
    buf[2] = 0;
    buf[3] = 0;
    return CalcCRC16Bytes(VOSPI_PACKET_SIZE, (char *) buf);
}

static int sleep(sensor_t *sensor, int enable)
{
    if (enable) {
        DCMI_PWDN_LOW();
        systick_sleep(100);
    } else {
        DCMI_PWDN_HIGH();
        systick_sleep(100);
    }

    return 0;
}

static int read_reg(sensor_t *sensor, uint16_t reg_addr)
{
    uint16_t reg_data;
    if (cambus_readw2(sensor->slv_addr, reg_addr, &reg_data)) {
        return -1;
    }
    return reg_data;
}

static int write_reg(sensor_t *sensor, uint16_t reg_addr, uint16_t reg_data)
{
    return cambus_writew2(sensor->slv_addr, reg_addr, reg_data);
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat)
{
    return ((pixformat != PIXFORMAT_GRAYSCALE) && (pixformat != PIXFORMAT_RGB565)) ? - 1 : 0;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    return 0;
}

static int set_framerate(sensor_t *sensor, framerate_t framerate)
{
    return 0;
}

static int set_contrast(sensor_t *sensor, int level)
{
    return 0;
}

static int set_brightness(sensor_t *sensor, int level)
{
    return 0;
}

static int set_saturation(sensor_t *sensor, int level)
{
    return 0;
}

static int set_gainceiling(sensor_t *sensor, gainceiling_t gainceiling)
{
    return 0;
}

static int set_quality(sensor_t *sensor, int quality)
{
    return 0;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    return 0;
}

static int set_special_effect(sensor_t *sensor, sde_t sde)
{
    return 0;
}

static int set_auto_gain(sensor_t *sensor, int enable, float gain_db, float gain_db_ceiling)
{
    return 0;
}

static int get_gain_db(sensor_t *sensor, float *gain_db)
{
    return 0;
}

static int set_auto_exposure(sensor_t *sensor, int enable, int exposure_us)
{
    return 0;
}

static int get_exposure_us(sensor_t *sensor, int *exposure_us)
{
    return 0;
}

static int set_auto_whitebal(sensor_t *sensor, int enable, float r_gain_db, float g_gain_db, float b_gain_db)
{
    return 0;
}

static int get_rgb_gain_db(sensor_t *sensor, float *r_gain_db, float *g_gain_db, float *b_gain_db)
{
    return 0;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    h_mirror = enable;
    return 0;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    v_flip = enable;
    return 0;
}

static int set_lens_correction(sensor_t *sensor, int enable, int radi, int coef)
{
    return 0;
}

static int ioctl(sensor_t *sensor, int request, va_list ap)
{
    int ret = 0;

    if ((!h_res) || (!v_res)) {
        return -1;
    }

    switch (request) {
        case IOCTL_LEPTON_GET_WIDTH: {
            int *width = va_arg(ap, int *);
            *width = h_res;
            break;
        }
        case IOCTL_LEPTON_GET_HEIGHT: {
            int *height = va_arg(ap, int *);
            *height = v_res;
            break;
        }
        case IOCTL_LEPTON_GET_RADIOMETRY: {
            int *type = va_arg(ap, int *);
            *type = radiometry;
            break;
        }
        case IOCTL_LEPTON_GET_REFRESH: {
            int *refresh = va_arg(ap, int *);
            *refresh = (h_res == 80) ? 27 : 9;
            break;
        }
        case IOCTL_LEPTON_GET_RESOLUTION: {
            int *resolution = va_arg(ap, int *);
            *resolution = 14;
            break;
        }
        case IOCTL_LEPTON_RUN_COMMAND: {
            int command = va_arg(ap, int);
            ret = (LEP_RunCommand(&LEPHandle, command) == LEP_OK) ? 0 : -1;
            break;
        }
        case IOCTL_LEPTON_SET_ATTRIBUTE: {
            int command = va_arg(ap, int);
            uint16_t *data = va_arg(ap, uint16_t *);
            size_t data_len = va_arg(ap, size_t);
            ret = (LEP_SetAttribute(&LEPHandle, command, (LEP_ATTRIBUTE_T_PTR) data, data_len) == LEP_OK) ? 0 : -1;
            break;
        }
        case IOCTL_LEPTON_GET_ATTRIBUTE: {
            int command = va_arg(ap, int);
            uint16_t *data = va_arg(ap, uint16_t *);
            size_t data_len = va_arg(ap, size_t);
            ret = (LEP_GetAttribute(&LEPHandle, command, (LEP_ATTRIBUTE_T_PTR) data, data_len) == LEP_OK) ? 0 : -1;
            break;
        }
        case IOCTL_LEPTON_GET_FPA_TEMPERATURE: {
            int *temp = va_arg(ap, int *);
            LEP_SYS_FPA_TEMPERATURE_KELVIN_T tfpa;
            ret = (LEP_GetSysFpaTemperatureKelvin(&LEPHandle, &tfpa) == LEP_OK) ? 0 : -1;
            *temp = tfpa;
            break;
        }
        case IOCTL_LEPTON_GET_AUX_TEMPERATURE: {
            int *temp = va_arg(ap, int *);
            LEP_SYS_AUX_TEMPERATURE_KELVIN_T taux;
            ret = (LEP_GetSysAuxTemperatureKelvin(&LEPHandle, &taux) == LEP_OK) ? 0 : -1;
            *temp = taux;
            break;
        }
        case IOCTL_LEPTON_SET_MEASUREMENT_MODE: {
            int enabled = va_arg(ap, int);
            if (measurement_mode != enabled) {
                measurement_mode = enabled;
                ret = lepton_reset(sensor, measurement_mode);
            }
            break;
        }
        case IOCTL_LEPTON_GET_MEASUREMENT_MODE: {
            bool *enabled = va_arg(ap, bool *);
            *enabled = measurement_mode;
            break;
        }
        case IOCTL_LEPTON_SET_MEASUREMENT_RANGE: {
            float *arg_min_temp = va_arg(ap, float *);
            float *arg_max_temp = va_arg(ap, float *);
            min_temp = IM_MAX(IM_MIN(*arg_min_temp, *arg_max_temp), -10.0f);
            max_temp = IM_MIN(IM_MAX(*arg_max_temp, *arg_min_temp), 140.0f);
            break;
        }
        case IOCTL_LEPTON_GET_MEASUREMENT_RANGE: {
            float *ptr_min_temp = va_arg(ap, float *);
            float *ptr_max_temp = va_arg(ap, float *);
            *ptr_min_temp = min_temp;
            *ptr_max_temp = max_temp;
            break;
        }
        default: {
            ret = -1;
            break;
        }
    }

    return ret;
}


static int lepton_reset(sensor_t *sensor, bool measurement_mode)
{
    DCMI_PWDN_LOW();
    systick_sleep(10);

    DCMI_PWDN_HIGH();
    systick_sleep(10);

    DCMI_RESET_LOW();
    systick_sleep(10);

