davidhuwyler/openmv/src/omv_imxrt/lepton.c
    DCMI_RESET_HIGH();
    systick_sleep(1000);

    LEP_RAD_ENABLE_E rad;
    LEP_AGC_ROI_T roi;
    memset(&LEPHandle, 0, sizeof(LEP_CAMERA_PORT_DESC_T));

    uint32_t start = HAL_GetTick();
    while(true)
    {
        if (LEP_OpenPort(0, LEP_CCI_TWI, 0, &LEPHandle) == LEP_OK) {
            break;
        }
        if (HAL_GetTick() - start >= LEPTON_TIMEOUT) {
            return -1;
        }
        systick_sleep(1);
    }

    start = HAL_GetTick();
    while(true)
    {
        LEP_SDK_BOOT_STATUS_E status;
        if (LEP_GetCameraBootStatus(&LEPHandle, &status) != LEP_OK) {
            return -1;
        }
        if (status == LEP_BOOT_STATUS_BOOTED) {
            break;
        }
        if (HAL_GetTick() - start >= LEPTON_TIMEOUT) {
            return -1;
        }
        systick_sleep(1);
    }

    start = HAL_GetTick();
    while(true)
    {
        LEP_UINT16 status;
        if (LEP_DirectReadRegister(&LEPHandle, LEP_I2C_STATUS_REG, &status) != LEP_OK) {
            return -1;
        }
        if (!(status & LEP_I2C_STATUS_BUSY_BIT_MASK)) {
            break;
        }
        if (HAL_GetTick() - start >= LEPTON_TIMEOUT) {
            return -1;
        }
        systick_sleep(1);
    }

    if (LEP_GetRadEnableState(&LEPHandle, &rad) != LEP_OK
        || LEP_GetAgcROI(&LEPHandle, &roi) != LEP_OK) {
        return -1;
    }

    if (!measurement_mode) {
        if (LEP_SetRadEnableState(&LEPHandle, LEP_RAD_DISABLE) != LEP_OK
            || LEP_SetAgcEnableState(&LEPHandle, LEP_AGC_ENABLE) != LEP_OK
            || LEP_SetAgcCalcEnableState(&LEPHandle, LEP_AGC_ENABLE) != LEP_OK) {
            return -1;
        }
    }

    h_res = roi.endCol + 1;
    v_res = roi.endRow + 1;
    radiometry = (rad == LEP_RAD_ENABLE);

    if (v_res > 60) {
        vospi_packets = 240;
    } else {
        vospi_packets = 60;
    }

    // resync and enable DMA before the first snapshot.
    vospi_resync = true;
    return 0;
}

static int reset(sensor_t *sensor)
{
    h_res = 0;
    v_res = 0;
    v_flip = false;
    h_mirror = false;
    radiometry = false;
    measurement_mode = false;
    min_temp = DEFAULT_MIN_TEMP;
    max_temp = DEFAULT_MAX_TEMP;
    return lepton_reset(sensor, false);
}

void HAL_SPI_RxCpltCallback(uint32_t event)
{
    (void) lepton_calc_crc; // to shut the compiler up.

    if (vospi_resync == true) {
        DRIVER_MASTER_SPI.Receive(vospi_packet, VOSPI_PACKET_SIZE);
        return; // nothing to do here
    }

    if (vospi_pid < vospi_packets && (vospi_packet[0] & 0xF) != 0xF) {
        uint32_t pid = VOSPI_HEADER_PID(vospi_packet);
        uint32_t seg = VOSPI_HEADER_SEG(vospi_packet);
        if (pid != (vospi_pid % VOSPI_NUMBER_PACKETS)) {
            if (vospi_pid == VOSPI_FIRST_PACKET) {
                // Wait for the first packet of the first segement.
                vospi_pid = VOSPI_FIRST_PACKET;
                vospi_seg = VOSPI_FIRST_SEGMENT;                
            } else { // lost sync
                vospi_resync = true;
                debug_printf("lost sync, packet id:%lu expected id:%lu \n", pid, vospi_pid);
            }
        } else if (vospi_packets > 60 && pid == VOSPI_SPECIAL_PACKET && seg != vospi_seg ) {
            if (vospi_seg == VOSPI_FIRST_SEGMENT) {
                // Wait for the first packet of the first segement.
                vospi_pid = VOSPI_FIRST_PACKET;
                vospi_seg = VOSPI_FIRST_SEGMENT;
            } else { // lost sync
                vospi_resync = true;
                debug_printf("lost sync, segment id:%lu expected id:%lu\n", seg, vospi_seg);
            }
        } else {
            memcpy(vospi_buffer + vospi_pid * VOSPI_LINE_SIZE,
                    vospi_packet + VOSPI_HEADER_SIZE, VOSPI_LINE_SIZE);
            if ((++vospi_pid % VOSPI_NUMBER_PACKETS) == 0) {
                vospi_seg++;                
            }
        }        
    }
    DRIVER_MASTER_SPI.Receive(vospi_packet, VOSPI_PACKET_SIZE);
}

static int sensor_check_buffsize(sensor_t *sensor)
{
    int bpp=0;
    switch (sensor->pixformat) {
        case PIXFORMAT_BAYER:
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        default:
            break;
    }

    if ((MAIN_FB()->w * MAIN_FB()->h * bpp) > OMV_RAW_BUF_SIZE) {
        return -1;
    }

    return 0;
}

static int snapshot(sensor_t *sensor, image_t *image, streaming_cb_t streaming_cb)
{
    fb_update_jpeg_buffer();

    if (sensor_check_buffsize(sensor) == -1) {
        return -1;
    }
    
    if ((!h_res) || (!v_res) || (!sensor->framesize) || (!sensor->pixformat)) {
        return -1;
    }

    bool frame_ready = false;
    bool streaming = (streaming_cb != NULL); // Streaming mode.

    do {
        //HAL_NVIC_DisableIRQ(LEPTON_SPI_DMA_IRQn);
        vospi_pid = VOSPI_FIRST_PACKET;
        vospi_seg = VOSPI_FIRST_SEGMENT;
        //HAL_NVIC_EnableIRQ(LEPTON_SPI_DMA_IRQn);

        DRIVER_MASTER_SPI.Receive(vospi_packet, VOSPI_PACKET_SIZE);

        // Snapshot start tick
        uint32_t tick_start = HAL_GetTick();
        bool reset_tried = false;

        do {
            if (vospi_resync == true) {
                lepton_sync();
            }
            if (frame_ready == true && streaming_cb != NULL) {
                // Start streaming the frame while a new one is captured.
                streaming = streaming_cb(image);
                frame_ready = false;
            } else {
                __WFI();
            }
            if ((HAL_GetTick() - tick_start) >= 20000) {
                // Timeout error.
                return -1;
            }
            if ((!reset_tried) && ((HAL_GetTick() - tick_start) >= 10000)) {
                reset_tried = true;

                // The FLIR lepton might have crashed so reset it (it does this).
                bool temp_h_mirror = h_mirror;
                bool temp_v_flip = v_flip;
                int ret = lepton_reset(sensor, measurement_mode);
                h_mirror = temp_h_mirror;
                v_flip = temp_v_flip;

                if (ret < 0) {
                    return -1;
                }

