davidhuwyler/openmv/src/omv_imxrt/lepton.c
                // Reset the VOSPI interface again.
                //HAL_NVIC_DisableIRQ(LEPTON_SPI_DMA_IRQn);
                vospi_pid = VOSPI_FIRST_PACKET;
                vospi_seg = VOSPI_FIRST_SEGMENT;
                //HAL_NVIC_EnableIRQ(LEPTON_SPI_DMA_IRQn);
            }
        } while (vospi_pid < vospi_packets); // only checking one volatile var so atomic.

        MAIN_FB()->w = MAIN_FB()->u;
        MAIN_FB()->h = MAIN_FB()->v;

        switch (sensor->pixformat) {
            case PIXFORMAT_GRAYSCALE: {
                MAIN_FB()->bpp = IMAGE_BPP_GRAYSCALE;
                break;
            }
            case PIXFORMAT_RGB565: {
                MAIN_FB()->bpp = IMAGE_BPP_RGB565;
                break;
            }
            default: {
                break;
            }
        }

        image->w = MAIN_FB()->u;
        image->h = MAIN_FB()->v;
        image->bpp = MAIN_FB()->bpp; // invalid
        image->data = MAIN_FB()->pixels; // valid

        uint16_t *src = (uint16_t*) vospi_buffer;

        float x_scale = resolution[sensor->framesize][0] / ((float) h_res);
        float y_scale = resolution[sensor->framesize][1] / ((float) v_res);
        // MAX == KeepAspectRationByExpanding - MIN == KeepAspectRatio
        float scale = IM_MAX(x_scale, y_scale), scale_inv = 1.0f / scale;
        int x_offset = (resolution[sensor->framesize][0] - (h_res * scale)) / 2;
        int y_offset = (resolution[sensor->framesize][1] - (v_res * scale)) / 2;
        // The code below upscales the source image to the requested frame size
        // and then crops it to the window set by the user.

        LEP_SYS_FPA_TEMPERATURE_KELVIN_T kelvin;
        if (measurement_mode && (!radiometry)) {
            if (LEP_GetSysFpaTemperatureKelvin(&LEPHandle, &kelvin) != LEP_OK) {
                return -1;
            }
        }

        for (int y = y_offset, yy = fast_ceilf(v_res * scale) + y_offset; y < yy; y++) {
            if ((MAIN_FB()->y <= y) && (y < (MAIN_FB()->y + MAIN_FB()->v))) { // user window cropping

                uint16_t *row_ptr = src + (fast_floorf(y * scale_inv) * h_res);

                for (int x = x_offset, xx = fast_ceilf(h_res * scale) + x_offset; x < xx; x++) {
                    if ((MAIN_FB()->x <= x) && (x < (MAIN_FB()->x + MAIN_FB()->u))) { // user window cropping

                        // Value is the 14/16-bit value from the FLIR IR camera.
                        // However, with AGC enabled only the bottom 8-bits are non-zero.
                        int value = __REV16(row_ptr[fast_floorf(x * scale_inv)]);

                        if (measurement_mode) {
                            // Need to convert 14/16-bits to 8-bits ourselves...
                            if (!radiometry) value = (value - 8192) + kelvin;
                            float celsius = (value * 0.01f) - 273.15f;
                            celsius = IM_MAX(IM_MIN(celsius, max_temp), min_temp);
                            value = IM_MAX(IM_MIN(IM_DIV(((celsius - min_temp) * 255), (max_temp - min_temp)), 255), 0);
                        }

                        int t_x = x - MAIN_FB()->x;
                        int t_y = y - MAIN_FB()->y;

                        if (h_mirror) t_x = MAIN_FB()->u - t_x - 1;
                        if (v_flip) t_y = MAIN_FB()->v - t_y - 1;

                        switch (sensor->pixformat) {
                            case PIXFORMAT_GRAYSCALE: {
                                IMAGE_PUT_GRAYSCALE_PIXEL(image, t_x, t_y, value & 0xFF);
                                break;
                            }
                            case PIXFORMAT_RGB565: {
                                IMAGE_PUT_RGB565_PIXEL(image, t_x, t_y, sensor->color_palette[value & 0xFF]);
                                break;
                            }
                            default: {
                                break;
                            }
                        }
                    }
                }
            }
        }

        frame_ready = true;
    } while (streaming && streaming_cb != NULL);
    return 0;
}

int lepton_init(sensor_t *sensor)
{
    sensor->gs_bpp              = sizeof(uint8_t);
    sensor->reset               = reset;
    sensor->sleep               = sleep;
    sensor->snapshot            = snapshot;
    sensor->read_reg            = read_reg;
    sensor->write_reg           = write_reg;
    sensor->set_pixformat       = set_pixformat;
    sensor->set_framesize       = set_framesize;
    sensor->set_framerate       = set_framerate;
    sensor->set_contrast        = set_contrast;
    sensor->set_brightness      = set_brightness;
    sensor->set_saturation      = set_saturation;
    sensor->set_gainceiling     = set_gainceiling;
    sensor->set_quality         = set_quality;
    sensor->set_colorbar        = set_colorbar;
    sensor->set_special_effect  = set_special_effect;
    sensor->set_auto_gain       = set_auto_gain;
    sensor->get_gain_db         = get_gain_db;
    sensor->set_auto_exposure   = set_auto_exposure;
    sensor->get_exposure_us     = get_exposure_us;
    sensor->set_auto_whitebal   = set_auto_whitebal;
    sensor->get_rgb_gain_db     = get_rgb_gain_db;
    sensor->set_hmirror         = set_hmirror;
    sensor->set_vflip           = set_vflip;
    sensor->set_lens_correction = set_lens_correction;
    sensor->ioctl               = ioctl;

    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_VSYNC, 1);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_HSYNC, 0);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_PIXCK, 0);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_FSYNC, 0);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_JPEGE, 0);

    // Configure the DMA handler for Transmission process
    /*
    DMAHandle.Instance                 = LEPTON_SPI_DMA_STREAM;
    DMAHandle.Init.Request             = LEPTON_SPI_DMA_REQUEST;
    DMAHandle.Init.Mode                = DMA_CIRCULAR;
    DMAHandle.Init.Priority            = DMA_PRIORITY_HIGH;
    DMAHandle.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    // When the DMA is configured in direct mode (the FIFO is disabled), the source and
    // destination transfer widths are equal, and both defined by PSIZE (MSIZE is ignored).
    // Additionally, burst transfers are not possible (MBURST and PBURST are both ignored).
    DMAHandle.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    DMAHandle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    // Note MBURST and PBURST are ignored.
    DMAHandle.Init.MemBurst            = DMA_MBURST_INC4;
    DMAHandle.Init.PeriphBurst         = DMA_PBURST_INC4;
    DMAHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    DMAHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    DMAHandle.Init.MemInc              = DMA_MINC_ENABLE;
    DMAHandle.Init.PeriphInc           = DMA_PINC_DISABLE;

    // NVIC configuration for DMA transfer complete interrupt
    NVIC_SetPriority(LEPTON_SPI_DMA_IRQn, IRQ_PRI_DMA21);
    HAL_NVIC_DisableIRQ(LEPTON_SPI_DMA_IRQn);

    HAL_DMA_DeInit(&DMAHandle);
    if (HAL_DMA_Init(&DMAHandle) != HAL_OK) {
        // Initialization Error
        return -1;
    }
*/


    CLOCK_SetMux(kCLOCK_LpspiMux, LPSPI_CLOCK_SOURCE_SELECT);
    CLOCK_SetDiv(kCLOCK_LpspiDiv, LPSPI_CLOCK_SOURCE_DIVIDER);

    /* DMA Mux init and EDMA init */
    edma_config_t edmaConfig = {0};
    EDMA_GetDefaultConfig(&edmaConfig);
    EDMA_Init(LEPTON_LPSPI_MASTER_DMA_BASEADDR, &edmaConfig);
    DMAMUX_Init(LEPTON_LPSPI_MASTER_DMA_MUX_BASEADDR);

    DRIVER_MASTER_SPI.Initialize(HAL_SPI_RxCpltCallback);
    DRIVER_MASTER_SPI.PowerControl(ARM_POWER_FULL);
    //DRIVER_MASTER_SPI.Control(ARM_SPI_MODE_MASTER, 1000000000/67);
    DRIVER_MASTER_SPI.Control(ARM_SPI_MODE_MASTER, 500000);


    //NVIC_EnableIRQ(LEPTON_LPSPI_MASTER_IRQN);	
	//LPSPI_MasterInit(LPSPI4, &mstCfg, LPSPI_MASTER_CLOCK_FREQ);
    //LPSPI_Reset(LPSPI4);
    //LPSPI_ClearStatusFlags(LPSPI4,kLPSPI_AllStatusFlag);
    ///----------------------------------------------------------

    // Associate the initialized DMA handle to the the SPI handle
    //__HAL_LINKDMA(&SPIHandle, hdmarx, DMAHandle);

    // NVIC configuration for SPI transfer complete interrupt
    //NVIC_SetPriority(LEPTON_SPI_IRQn, IRQ_PRI_DCMI);
    //HAL_NVIC_EnableIRQ(LEPTON_SPI_IRQn);

    return 0;
}
#else
int lepton_init(sensor_t *sensor)
{
    return -1;
}
#endif //defined(OMV_ENABLE_LEPTON)
